//Задача 1.
//Используйте класс Student из урока 60 (см. Student.java).
//
//Создайте список учеников с баллами.
//
//Попросите пользователя ввести минимальный проходной балл.
//
//Выведите список учеников согласно следующим условиям:
//
//каждый ученик выведен в отдельной строке
//сумма баллов каждого ученика выше минимального проходного.
//Ученики отсортированы по убыванию среднего балла
//в списке не больше 10 учеников (извините, конкурс)
//Для обработки и вывода результата используйте потоки (Stream).
public class Task1 {

}
